{
    "name":"Rajolu Gowtham",
    "email":"gowthamrajolu@gmail.com",
    "github":"https://github.com/gowtham-rajolu",
    "linkedin":"https://www.linkedin.com/in/gowtham-rajolu-242218218/overlay/about-this-profile/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base%3BwSgNoTg%2BSuaNHIECSx8GLA%3D%3D",
    "youtube":"https://www.youtube.com/@LoopProgramming",
    "instagram":"https://www.instagram.com/_._gowtham_nani_._/?igsh=bDZ3OW02Nml1M2xn#",
    "roles":["Frontend Developer","Backend Developer","Full Stack Developer","Designer", "Ethical Hacker","AI Engineer","and more..."],
    "projects": [
    {
      "title": "Voice-Based Virtual Assistant",
      "description": "This project aims to develop a voice-based virtual assistant that can assist with various tasks on a computer or smart home system. The assistant responds to voice commands and provides functionalities such as launching applications, managing files, sending emails, providing weather updates, and much more.",
      "link": "https://github.com/gowtham-rajolu/virtual_assistant",
      "image":"https://videos.openai.com/vg-assets/assets%2Ftask_01k1qd7b2je87v11hw2j8e7vyf%2F1754206164_img_1.webp?st=2025-08-03T06%3A09%3A03Z&se=2025-08-09T07%3A09%3A03Z&sks=b&skt=2025-08-03T06%3A09%3A03Z&ske=2025-08-09T07%3A09%3A03Z&sktid=a48cca56-e6da-484e-a814-9c849652bcb3&skoid=8ebb0df1-a278-4e2e-9c20-f2d373479b3a&skv=2019-02-02&sv=2018-11-09&sr=b&sp=r&spr=https%2Chttp&sig=InN0etFX4t%2FC41o7cSAFLupmj2V5IE5HQbfGHfE7oq0%3D&az=oaivgprodscus"
    },
    {
      "title": "Smart SDLC – AI-Powered Project Management Tool",
      "description": "A full-stack AI-powered developer assistant that streamlines the entire Software Development Life Cycle (SDLC). Each phase—Requirements, Development, Testing, and Optimization—has its own interface with dedicated tools, enabling developers to speed up workflow and reduce manual effort.",
      "link": "https://github.com/gowtham-rajolu/ibm"
    },
    {
      "title": "Event Aggregator",
      "description": "Event Aggregator is a full-stack web app that displays college fest events and allows students to register for them. Built with Express.js, HTML, and MySQL (via phpMyAdmin), it offers a simple interface for event discovery and registration. The platform stores all student and event data securely and streamlines coordination for both organizers and participants.",
      "link": "https://github.com/gowtham-rajolu/event_aggrigator"
    },
    {
      "title":"Currency Converter Web App",
      "description":"A responsive web application that allows users to convert amounts between different currencies using real-time exchange rates. It fetches live data from a public currency exchange API and performs instant conversion based on user-selected currencies and input amount. The app is built using modern frontend technologies and hosted on Netlify at currencyconverterfor4.netlify.app. It showcases skills in API integration, user interface design, and client-side JavaScript development.",
      "link":"https://currencyconverterfor4.netlify.app/"
    },
    {
      "title":"Chat App Dashboard (Next.js + Socket.IO)",
      "description":"A real-time chat dashboard built with Next.js and Socket.IO, offering seamless, low-latency communication. Users can join rooms, send and receive messages instantly via WebSockets, and enjoy dynamic updates without reloading the page. The UI is fully responsive, modern, and optimized for smooth user experience. Key features include real-time message rendering, automatic scroll-to-latest, message status updates, and room-based conversation handling. Ideal for collaboration tools, support chat systems, or community messaging apps.",
      "link":"https://github.com/gowtham-rajolu/chat-app"
    },
    {
      "title":"Vision-Controlled Automation System",
      "description": "A smart automation system that integrates Computer Vision (via OpenCV) with Arduino to detect visual cues and trigger real-world hardware actions. The system uses a webcam to analyze images or video in real-time, such as recognizing hand gestures, faces, or color objects, and sends signals to an Arduino microcontroller to activate components like motors, LEDs, or buzzers. This project bridges AI-driven perception with embedded hardware control, making it ideal for smart home automation, gesture-controlled robots, or AI-based security systems.",
      "link":"https://github.com/gowtham-rajolu/aurdino"
    },
    {
      "title": "NSK – Job Seekers Platform",
      "description": "NSK is a web-based job seekers platform that helps individuals discover, explore, and register for job opportunities. The platform allows users to create profiles, browse available job listings, and apply for positions with a simple and intuitive interface. Developed using Next.js for the frontend and application logic, MongoDB for managing user data, and phpMyAdmin (MySQL) for job listings , NSK aims to simplify the job search and recruitment process with an efficient and user-friendly experience.",
      "link":"https://github.com/gowtham-rajolu/NSK"
    },
    {
      "title": "Dynamic Portfolio with JSON & Next.js",
      "description": "A personal portfolio website developed using Next.js that loads all its dynamic content from a single external JSON file. This architecture enables seamless updates without modifying the codebase, making it ideal for non-technical users or quick customization. It includes sections such as Hero, About, Projects, and Contact—each rendered based on JSON keys and values.\n\nThe site features smooth animations using AOS (Animate on Scroll), a typewriter effect using React Typed, and a responsive layout designed for all devices. \n\nThis portfolio is optimized for performance, SEO-friendly, and deployable via platforms like Vercel . ",
      "link":"https://github.com/gowtham-rajolu/nextjs_portfolio"
    },
    {
      "title":"Voice-Controlled Home Automation System",
      "description":"A smart home automation project that uses voice commands to control electrical appliances like lights, fans, or alarms. The system integrates a Python-based voice recognition script on a PC or laptop, which captures and processes voice input using libraries such as speech_recognition and pyttsx3. Recognized commands are sent to an Arduino board via serial communication, which then triggers corresponding hardware components using relays or digital outputs.",
      "link":"https://github.com/gowtham-rajolu/aurdino"
    }

  ],
 "about": "Hi, I’m Gowtham Rajolu, a Computer Science student with a passion for building intelligent, user-centric digital solutions. I work with modern web and AI technologies like Next.js, Streamlit, and FastAPI, focusing on automation, responsive design, and seamless user experience. I enjoy combining software development with emerging tools in AI to create smart and scalable applications.\n\nBeyond tech, I’m also a professional photographer, videographer, and editor, skilled in capturing and crafting compelling visual stories. My dual interest in technology and creativity helps me bring a balanced and unique approach to everything I build—whether it's code or content.\n\nI'm continuously learning, exploring new tools, and pushing myself to grow in both the tech and creative fields."
}
